Revit 2027 API
TopographySurface.GetBoundaryPoints Method
 Gets the points which are on the boundary of the topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetBoundaryPoints()
Public Function GetBoundaryPoints As IList(Of XYZ)
public:
IList<XYZ^>^ GetBoundaryPoints()
member GetBoundaryPoints : unit -> IList<XYZ>
Return Value
IList<XYZ>
 The collection of boundary points.
Remarks
 This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element. For a SiteSubRegion, this returns the points from a representation of the region's boundary. For the topography surface associated with a BuildingPad element, this returns the points from the sketch of this topography surface.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace